AddressBook/src/main/resources/com/sijiang/webservice/soap/message_format/FindPersonRequest.xml

<?xml version="1.0" encoding="utf-8"?>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header />
	<soapenv:Body>
		<findbylastnameandfirstname:FindPersonRequest
			xmlns:findbylastnameandfirstname="http://addressbook.com/find_person_by_lastname_and_firstname">
			<firstname>Siyu</firstname>
			<lastname>Jiang</lastname>
		</findbylastnameandfirstname:FindPersonRequest>
	</soapenv:Body>
</soapenv:Envelope>